using Gunner.Models;
using System.Collections.ObjectModel;
using System.Windows.Input;
using System.Net.Http;
using System.Threading.Tasks;

namespace Gunner.Views;

public partial class MainPage : ContentPage
{
    // สร้าง ObservableCollection สำหรับแต่ละหมวดอาหาร
    public ObservableCollection<Models.DessertModel> Dessert { get; set; }
    public ObservableCollection<Models.CFoodModel> CFood { get; set; }
    public ObservableCollection<Models.DimsumModel> Dimsum { get; set; }
    public ObservableCollection<Models.DrinkModel> Drink { get; set; }
    string username = "Admin";

    // Constructor สำหรับหน้าเพจหลัก
    public MainPage()
    {
        InitializeComponent(); // เริ่มต้น UI จาก XAML

        // เรียกใช้เมธอดในการสร้างรายการเมนู
        ImageDesserr();
        ImageCFood();
        ImageDimsum();
        ImageDrink();

        // กำหนดบริบทการเชื่อมโยงข้อมูล
        BindingContext = new { Dessert, CFood, Dimsum, Drink };
    }
    // เมธอดสำหรับสร้างรายการเมนูของหวาน
    private void ImageDesserr()
    {
        Dessert = new ObservableCollection<Models.DessertModel>
        {
            new Models.DessertModel("image1" , "สตรอว์เบอร์รีชอร์ตเค้ก" , "• เค้กสำเร็จรูป (ในสูตรใช้บัตเตอร์เค้กของ S&P)\n• วิปครีมแบบ Non Dairy 200 กรัม\n• สตรอว์เบอร์รีสด" ,
            "STEP 1 : นำเค้กสำเร็จรูปมาสไลซ์ความหนาตามต้องการ กดด้วยแม่พิมพ์กดคุกกี้ (อาจใช้ถ้วยหรือแก้วอะไรก็ได้ที่สามารถกดได้)\nSTEP 2 : ตีวิปครีมให้ตั้งยอดแข็ง ตักใส่ถุงบีบ เพื่อสะดวกต่อการบีบ ตัดปลายถุงให้กว้างประมาณ 1 เซนติเมตร" +
            "\nSTEP 3 : ประกอบเค้กโดยวางเค้กบนฐานกระดาษ ตัดแผ่นพลาสติกใสให้พอดีกับเค้กของเรา พันพลาสติกใสรอบเค้ก ติดเทปให้เรียบร้อย\nSTEP 4 : หั่นสตรอว์เบอร์รี 2 แบบ โดยแบบแรกหั่นตามขวาง 1 ลูกหั่นให้ได้ 4 ชิ้น และแบบที่ 2 หั่นเต๋า\n" +
            "STEP 5 : ประกอบเค้กกัน โดย\n     - บีบครีมบาง ๆ เป็นวงกลมรอบตัวเค้ก\r\n     - วางสตรอว์เบอร์รีที่หั่นขวางให้ชิดแนบกับแผ่นพลาสติก\r\n     - บีบครีมทับลงไปให้ทั่ว\r\n     - วางสตรอว์เบอร์รีแบบเต๋าตรงกลาง\r\n     - บีบครีมทับสตรอว์เบอร์รีแบบเต๋า\r\n     - วางเค้กลงไป กดเบา ๆ\r\n     - บีบครีมทับอีกรอบ \r\n     - ปาดครีมด้านบนให้เรียบ\r\n     - ตกแต่งด้วยผลสตรอว์เบอร์รีสด",username),
            
            new Models.DessertModel("image2" , "สตอเบอรี่มิลค์เช็ค" , "นมจืด 200 ml.\r\nไอศกรีมวนิลา 2 ลูก\r\nสตรอว์เบอร์รี ตามชอบ\r\nวิปปิ้งครีม 50 ml.\r\nน้ำตาล 2 ชต." , "STEP 1 : ใส่วิปปิ้งครีมลงไปในชามผสม จากนั้นตีให้เซตตัว\r\nSTEP 2 : ใส่นมจืดลงโถปั่น ตามด้วยน้ำตาล\r\nSTEP 3 : ใส่ไอศกรีมวนิลาลงไป ตามด้วยสตรอว์เบอร์รี จากนั้นปั่นให้ละเอียดเข้ากัน และเทใส่แก้วเลย\r\nSTEP 4 : บีบวิปปิ้งครีมที่ตีแล้วลงไปเพิ่ม\r\nSTEP 5 : ตกแต่งได้ตามชอบเลย", username),
            new Models.DessertModel("image3" , "ไวท์ช็อกสตอเบอรี่" , "ไวต์ช็อกโกแลต 1/2 ถ้วย\r\nวิปปิงครีม 1 ถ้วย\r\nน้ำตาลไอซิง 1/4 ถ้วย\r\nสตรอว์เบอร์รีหั่นหยาบ 1 ถ้วย\r\nน้ำตาลทราย 2 ช้อนโต๊ะ\r\nน้ำเปล่า 4 ช้อนโต๊ะ\r\nเจลาติน 1 1/2 ช้อนโต๊ะ\r\nสตรอว์เบอร์รีสำหรับตกแต่ง" 
            , "STEP 1 : นำเจลาติน 1 ช้อนโต๊ะไปผสมกับน้ำเปล่า 1/4 ถ้วยในชามแก้ววางไว้ 5 นาที ใส่ไวต์ช็อกโกแลตลงไปแล้วนำไปเข้าไมโครเวฟครั้งละ 20-30 วินาที นำออกมาคนจนส่วนผสมเนียน\r\n\r\nSTEP 2 : ผสมวิปปิงครีมกับน้ำตาลไอซิงคนให้เข้ากันแล้วตีด้วยตะกร้อจนขึ้นฟู ใส่ส่วนผสมไวต์ช็อกโกแลตลงไปคนให้เข้ากัน ตักมูสช็อกโกแลตใส่ถ้วยนำไปแช่เย็นไว้\r\n\r\nSTEP 3 : ผสมเจลาติน1/2 ช้อนโต๊ะกับน้ำเปล่า 4 ช้อนโต๊ะ คนให้เข้ากันวางพักไว้ 5 นาทีแล้วเทลงในหม้อขนาดเล็กผสมกับสตรอว์เบอร์รีและน้ำตาลทราย ตั้งไฟอ่อนคนไปเรื่อยๆ จนได้ซอสตรอว์เบอร์รี พักไว้ให้เย็นจากนั้นตักหยอดลงบนหน้าไวต์ช็อกโกแลตมูสแล้วนำไปแช่เย็นไว้จนกว่าจะเสิร์ฟ",username),
        };
    }
    // เมธอดสำหรับสร้างรายการเมนูอาหารคาว
    private void ImageCFood()
    {
        CFood = new ObservableCollection<Models.CFoodModel>
        {
            new Models.CFoodModel("image4" , "ข้าวผัด" , "ข้าวสวยหุงสุก 1 ถ้วย  - ที่นิยมใช้กันคือ ข้าวเสาไห้ และข้าวหอมมะลิ\r\nไข่ไก่ 2 ฟอง  - หากใช้เป็นไข่เป็ดก็จะทำให้มีสีสันเข้มกว่าและได้รสชาติที่ดีไปอีกแบบ\r\nต้นหอม 1 ช้อนโต๊ะ -  เพื่อเพิ่มสีสันให้กับจาน\r\nเกลือ ½ ช้อนชา - เพื่อปรุงรสให้ข้าวผัดไข่มีรสชาติที่กลมกล่อมมากขึ้นและทำให้ข้าวไม่แฉะ\r\nพริกไทย 1 ช้อนชา - เพื่อเพิ่มกลิ่นหอมและความเผ็ดร้อนให้กับตัวข้าวผัด\r\nน้ำมันพืช 3 ช้อนโต๊ะ - ควรใช้น้ำมันสำหรับผัด เช่น น้ำมันถั่วเหลือง" , "STEP 1 : ผัดข้าว\r\nเทน้ำมันลงในกระทะ วนให้น้ำมันทั่วกระทะแล้วเทน้ำมันออก \r\nนำข้าวสวยมาผัดให้ข้าวร้อนและร่วน \r\nSTEP 2 : ผัดไข่\r\nตอกไข่ลงแล้วผัดให้ไข่เคลือบเม็ดข้าวให้ทั่ว\r\nผัดให้ไข่สุก แล้วข้าวสีเหลืองไข่สวยงาม\r\nSTEP 3 : ปรุงรสข้าวผัดไข่\r\nปรุงรสด้วยเกลือ และพริกไทย ใส่ต้นหอมซอย เพื่อเพิ่มความสวยงาม",username),
            new Models.CFoodModel("image5" , "ต้มจืด" , "หมูสับ200 กรัม\r\nเต้าหู้ถั่วเหลือง1 หลอด\r\nเต้าหู้ไข่ไก่1 หลอด\r\nลูกชิ้น12 ลูก\r\nผักกาดขาว1 หัวเล็ก\r\nต้นหอม ผักชีตามชอบ\r\nซีอิ๊วขาว\r\nซุปหมูก้อน" , "เวลาเตรียมส่วนผสม: 30 นาที\r\nเวลาปรุงอาหาร: 5 นาที\r\nSTEP 1 : ตั้งน้ำให้เดือดแล้วใส่ซุปก้อนลงไปหนึ่งก้อน รอจนเดือดและละลายดี\r\nSTEP 2 : ใส่หมูสับหมักลงไป ตามด้วยลูกชิ้นและผักกาดขาว\r\nเคล็ดลับ: หมูสับหมัก : หมักด้วยรากผักชี กระเทียม พริกไทยโขลกละเอียด, น้ำมันหอย, ซีอิ๊วขาว, น้ำตาลทราย และผงฟู\r\nSTEP 3 : ใส่เต้าหู้ไข่และเต้าหู้ถั่วเหลืองเป็นอย่างสุดท้าย เต้าหู้จะได้ไม่แตก\r\nSTEP 4 : จัดใส่ถ้วย โรยต้นหอม ผักชี หรือกระเทียมเจียวตามชอบ", username),
            new Models.CFoodModel("image6" , "กระเพราหมูสับไข่ดาว" , "เนื้อหมู 250 กรัม\r\nกะเพรา 15 กรัม\r\nซอสหอยนางรม 1 1/2 ช้อนโต๊ะ\r\nน้ำปลา 2/3 ช้อนโต๊ะ\r\nน้ำตาลทราย 1/2 ช้อนชา\r\nพริกแดงจินดา 40 กรัม\r\nกระเทียม 30 กรัม\r\nพริกไทยป่น 1/2 ช้อนชา\r\nไข่ 1 ฟอง" , "ตั้งกระทะใส่น้ำมัน แล้วทอดไข่ดาวให้สุกก่อนจากนั้นนำไข่ดาวขึ้นมาพักไว้และใส่พริกกระเทียมที่ตำไว้เจียวให้หอม จากนั้นใส่เนื้อที่หั่นไว้เป็นชิ้นลงไป เมื่อผัดจนเนื้อเกือบจะสุกให้ปรุงรสด้วยซอสหอยนางรม น้ำตาลทราย พริกไทยป่นเพิ่มความหอม จากนั้นผัดต่อจนเนื้อสุกหากชิมแล้วยังไม่ได้รสชาติที่ต้องการสามารถปรุงอีกได้ จากนั้นใส่ใบกะเพราผัดจนใบกะเพราสุก เสร็จแล้วตักใส่จานพร้อมรับประทาน", username),
        };
    }
    // เมธอดสำหรับสร้างรายการเมนูติ่มซำ
    private void ImageDimsum()
    {
        Dimsum = new ObservableCollection<Models.DimsumModel>
        {
            new Models.DimsumModel("image7" , "ฮะเก๋า" , "เนื้อกุ้ง 300 กรัม\r\nมันหมูสับหยาบ 50 กรัม\r\nเกลือ 1/2 ช้อนชา\r\nพริกไทยขาวป่น 1/2 ช้อนชา\r\nแป้งมันฮ่องกง 1 ช้อนโต๊ะ\r\nน้ำมันงา 1 ช้อนชา\r\nไข่ขาว 1 ช้อนโต๊ะ\r\nแป้งตั้งหมิ่น 100 กรัม\r\nแป้งข้าวโพด 25 กรัม\r\nแป้งมันฮ่องกง 25 กรัม\r\nเกลือ 1/2 ช้อนชา\r\nน้ำเดือด 3/4 ถ้วย\r\nน้ำมันพืช 1/2 ช้อนโต๊ะ" , "เตรียมไส้กุ้ง แกะเปลือกกุ้ง หางกุ้ง และเอาเส้นดำกลางหลังออก ล้างกุ้งด้วยเกลือเคล้าให้ทั่ว จากนั้น นำไปล้างน้ำ เป็นเวลา 15-20 นาที พักกุ้ง บนตะแกรง นำไปวางผึ่งในตู้เย็น 3 ชั่วโมง\r\nเมื่อครบเวลา นำกุ้งออกมา แบ่งกุ้งเป็นตัว แยกไว้ ประมาณ 15 ตัว ส่วนที่เหลือ นำไปตบพอให้แบนเล็กน้อย สับหยาบ ๆ\r\nนำกุ้งที่สับ ใส่ในชามผสม ปรุงรสด้วย เกลือ พริกไทยขาวป่น แป้งมันฮ่องกง น้ำมันงา ไข่ขาว ลงนวดให้เข้ากันจนหนียว แล้วนำไปพักไว้ในตู้เย็น ประมาณ 30 นาที\r\nเตรียมแป้งฮธเก๋า เตรียมชามผสม ร่อนแป้ง แป้งตั้งหมิ่น แป้งข้าวโพด แป้งมันฮ่องกง และเกลือ เติมน้ำเดือดจัด ๆ ลงในชามแป้ง\r\nใช้ตะเกียบคนให้พอเข้ากัน ปิดฝาทิ้งไว้ 2 นาที แล้วใส่น้ำมันพืชลงไป นวดแป้งให้เข้ากันดี จนเป็นเนื้อเดียวกัน\r\nนำแป้งที่ทำเสร็จแล้ว มาปั้นเป็นแท่งยาว เส้นผ่านศูนย์กลาง ประมาณ 1.3 นิ้ว จากนั้น ตัดเป็นแว่น ๆ เอาไปรีดเป็นแผ่นบาง ๆ เตรียมไว้\r\nนำไส้กุ้ง และกุ้งเป็นตัว 1 ตัว ไปห่อกับแป้งฮะเก๋า ห่อจนครบ\r\nนำฮะเก๋าที่ห่อแล้ว ไปนึ่งน้ำเดือด ประมาณ 6 นาที จากนั้นยกลง จัดเสิร์ฟบนเข่งติ่มซำ คู่กับน้ำจิ้มจิ๊กโฉ่ว หรือซีอิ๊วเปรี้ยว พร้อมทาน",username),
            new Models.DimsumModel("image8" , "ขนมจีบ" , "กุ้งสับหยาบ 100 กรัม \r\nหมูบด 200 กรัม\r\nรากผักชี 2 ราก \r\nกระเทียม 3 กลีบ \r\nพริกไทยดำ 1 ช้อนชา \r\nแครอทหั่นเต๋า 50 กรัม \r\nแผ่นเกี๊ยว 20 แผ่น \r\nซอสปรุงรส 1 ช้อนโต๊ะ \r\nน้ำมันหอย 1 ช้อนโต๊ะ \r\nน้ำตาลทราย ½ ช้อนโต๊ะ \r\nน้ำมันงา 1 ช้อนชา \r\nแป้งข้าวโพด 1 ช้อนโต๊ะ" , "STEP 1 : ปรุงรสสำหรับทำไส้ขนมจีบ\r\n โขลกรากผักชี กระเทียมและพริกไทย เข้าด้วยกัน จากนั้นนำมาผสมกับกุ้งสับ หมูสับ แครอทหั่นเต๋า ปรุงรสด้วยซอสปรุงรส น้ำมันหอย น้ำตาล น้ำมันงา และแป้งข้าวโพด คลุกเคล้าให้ส่วนผสมเข้ากันเป็นเนื้อเดียว\r\n\r\nSTEP 2 : ห่อขนมจีบ\r\nห่อขนมจีบ โดยการวางแผ่นเกี๊ยวบนระหว่างนิ้วโป้งและนิ้วชี้ แล้วตักไส้ประมาณ 1 ช้อนโต๊ะใส่ลงไป ใช้นิ้วโป้งกับนิ้วชี้รูดแผ่นเกี๊ยวให้เป็นทรง แล้วใช้สันช้อนช่วยกดแผ่นเกี๊ยวให้เป็นจีบ\r\n\r\nSTEP 3 : นึ่งขนมจีบ\r\n เมื่อห่อเสร็จแล้ว พรมน้ำก่อนเพื่อให้แป้งนิ่ม ไม่แข็ง แล้วค่อยนึ่งเป็นเวลา 15-20 นาที หรือจนไส้สุก จากนั้นจัดเสิร์ฟ โรยกระเทียมเจียว กินกับจิ๊กโฉ่ว", username),
            new Models.DimsumModel("image9" , "ซาลาเปา" , "แป้งเค้ก 350 กรัม\r\nยีสต์ 1 ช้อนโต๊ะ\r\nน้ำตาลทราย 1 ช้อนโต๊ะ\r\nน้ำอุ่น 200 มิลลิลิตร\r\nวัตถุดิบแป้งซาลาเปา\r\nแป้งเค้ก 150 กรัม\r\nผงฟู ½ ช้อนโต๊ะ\r\nน้ำเปล่า 50 มิลลิลิตร\r\nน้ำตาลทราย 100 กรัม\r\nเกลือ 1 ช้อนชา\r\nน้ำมันพืช 50 มิลลิลิตร\r\nวัตถุดิบไส้หมูสับไข่เค็ม\r\nหมูบด 500 กรัม\r\nรากผักชี 3 ราก\r\nกระเทียม 1 หัว\r\nพริกไทยเม็ด 1 ช้อนโต๊ะ\r\nซอสหอยนางรม 3 ช้อนโต๊ะ\r\nซอสปรุงรส 2 ช้อนโต๊ะ\r\nน้ำตาลทราย 1 ช้อนโต๊ะ\r\nน้ำมันงา 1 ช้อนโต๊ะ\r\nไข่ไก่ 1 ฟอง\r\nแป้งข้าวโพด 2 ช้อนโต๊ะ\r\nต้นหอมซอย ตามชอบ\r\nไข่แดงเค็ม ตามชอบ" , "STEP 1 : ทำแป้งเชื้อซาลาเปา\r\nผสมแป้งเค้ก ยีสต์ น้ำตาลทราย และน้ำอุ่นเข้าด้วยกัน\r\nนวดให้เข้ากันประมาณ 10 นาที จนแป้งเนียน คลุมด้วยพลาสติกคลุมอาหาร พักไว้อุณหภูมิห้องระยะเวลา 60 นาที\r\n\r\nSTEP 2 : ทำแป้งซาลาเปา\r\nโขลกรากผักชี กระเทียม และพริกไทยเข้าด้วยกัน จากนั้นตักใส่ในชามหมูสับ\r\nใส่ซอสหอยน้ำมันหอยลงไป ตามด้วยซอสปรุงรส น้ำตาลทราย น้ำมันงา แป้งข้าวโพด ต้นหอมซอย และไข่ไก่ คนให้เข้ากันแล้วพักไว้\r\nทำแป้งโดว์ โดยร่อนแป้งเค้ก ผงฟู และเกลือ เข้าด้วยกัน ใส่น้ำตาลทรายลงไป ตามด้วยน้ำเปล่า น้ำมันพืช และแป้งเชื้อที่หมักไว้ นวดให้เข้ากันประมาณ 10 นาที จนแป้งเนียน จากนั้นแบ่งเป็นก้อนละ 60 กรัม เตรียมห่อกับไส้\r\n\r\nSTEP 3 : นึ่งซาลาเปา\r\nคลึงแป้งให้แบน ใส่ไส้หมูสับลงไป ตามด้วยไข่แดงเค็ม จากนั้นห่อให้มิด แล้ววางบนกระดาษรอง\r\nนำไปนึ่งบนน้ำเดือด 20 นาที เพียงเท่านี้ “ซาลาเปาไส้หมูสับไข่เค็ม” ของเราก็พร้อมกินแล้วจ้า!", username),
        };
    }
    // เมธอดสำหรับสร้างรายการเมนูเครื่องดื่ม
    private void ImageDrink()
    {
        Drink = new ObservableCollection<Models.DrinkModel>
        {
            new Models.DrinkModel("image10" , "สตรอว์เบอรี่เลม่อนเนด" , "สตรอว์เบอร์รีสด สไลซ์บาง ๆ 1 1/2 ถ้วย\r\nน้ำตาลทราย 1/2 ถ้วย\r\nน้ำเปล่า 2 ช้อนโต๊ะ\r\nน้ำมะนาวคั้น 2 ช้อนโต๊ะ\r\nน้ำเลมอนเนด 8 ออนซ์\r\nน้ำแข็ง 1 แก้ว" , "STEP 1 : ใส่สตรอว์เบอร์รีสด น้ำตาลทราย น้ำเปล่า และน้ำมะนาวลงในหม้อ\r\nSTEP 2 : คนผสมให้เข้ากันจนน้ำตาลทรายละลาย \r\nSTEP 3 : จากนั้นนำขึ้นตั้งไฟปานกลางเคี่ยวจนเดือดแล้วลดเป็นไฟอ่อนสุก เคี่ยวต่ออีก 5-7 นาที\r\nSTEP 4 : พอครบเวลาแล้ว ยกลงจากเตา พักทิ้งไว้จนเย็น (สามารถนำส่วนผสมทั้งหมดไปปั่นให้เป็นเนื้อเดียวกันได้)\r\nSTEP 5 : แต่งแก้วให้สวยงามก่อนเสิร์ฟได้โดย นำมะนาวมาทารอบ ๆ ปากแก้ว จากนั้นคว่ำแก้วลงในน้ำตาลทราย (เพื่อให้น้ำตาลติดที่รอบ ๆ ปากแก้ว)\r\nSTEP 6 : ตักซอสสตรอว์เบอร์รีที่เย็นแล้วลงในแก้ว ตามด้วยน้ำแข็ง สุดท้ายเทน้ำเลมอนเนดลงไป แต่งด้วยเลมอนฝานเป็นแว่น ๆ พร้อมเสิร์ฟ (หรือใครจะนำส่วนผสมทั้งหมดใส่ลงไปคนผสมกันในเหยือกก่อนนำมาเทใส่แก้วก็ได้)", username),
            new Models.DrinkModel("image11" , "น้ำสตรอว์เบอรี่" , "1.สตรอเบอรี่ 500 กรัม\r\n2.น้ำต้มสุก 400 กรัม\r\n3.น้ำตาลทราย 100 กรัม\r\n4.เกลือป่น 3 กรัม" , "STEP 1 : นำสตรอเบอรี่ที่แก่ล้างให้สะอาด\r\nSTEP 2 :นำสตรอเบอรี่ใส่น้ำต้มสุกปั่นแยกน้ำออกจากเนื้อ\r\nSTEP 3 :นำน้ำสตรอเบอรี่ที่ได้มาต้มในน้ำเชื่อมเข้มข้น(น้ำตาลทรายต้มกับน้ำสะอาด) ใส่เกลือ ต้มจนเดือด\r\nSTEP 4 :นำบรรจุใส่ขวดเก็บเข้าห้องเย็นอุณหภูมิประมาณ 18 องศาเซลเซียส เก็บได้ 1 ปี", username),
            new Models.DrinkModel("image12" , "น้ำส้มคั้นสด" , "เวลาเตรียมส่วนผสม: 5 นาที\r\nเวลาปรุงอาหาร: 10 นาที\r\n1 ล้างส้มให้สะอาด พึ่งให้สะเด็ดน้ำ\r\n2ผ่าส้มไว้ เตรียมคั้น\r\n3นำที่คั้นส้มวางไว้กับกะละมัง หรือ ภาชนะอะไรก็ได้ ตามสะดวก บีบคั้นจนส้มหมด กรองให้เรียบร้อย" , "ใส่เกลือลงไป คนให้เข้ากัน เทใส่แก้ว หรือขวดตามใจชอบ แช่ตู้เย็นไว้ ดื่มบ่ายๆ หรือยามเหนื่อย สดชื่นเลยค่า", username),
        };
    }
    // เมธอดสำหรับจัดการปุ่มนำทางไปหน้าเข้าสู่ระบบ
    private async void homeButton_Clicked(object sender, EventArgs e)
    {
        await Navigation.PushModalAsync(new MainPage());
    }

    private async void menuButton_Clicked(object sender, EventArgs e)
    {
        await Navigation.PushModalAsync(new MyPostPage());
    }

    private async void addButton_Clicked(object sender, EventArgs e)
    {
        await Navigation.PushModalAsync(new addPage());
    }

    private async void markButton_Clicked(object sender, EventArgs e)
    {
        await Navigation.PushModalAsync(new FavoritePage());
    }

    private async void logoutButton_Clicked(object sender, EventArgs e)
    {
        await Navigation.PushModalAsync(new AccountPage.LoginPage());

    }

    // เมธอดสำหรับจัดการการคลิกปุ่มในหมวดของหวาน
    private async void dessertButton_Clicked(object sender, EventArgs e)
    {
        if (sender is ImageButton button && button.BindingContext is DessertModel dessert)
        {
            await Navigation.PushModalAsync(new DetailPage(dessert.ImagePath, dessert.Name, dessert.Raw, dessert.Description,dessert.Username));
        }
    }

    // เมธอดสำหรับจัดการการคลิกปุ่มในหมวดอาหารคาว
    private async void CFoodButton_Clicked(object sender, EventArgs e)
    {
        if (sender is ImageButton button && button.BindingContext is CFoodModel cFood)
        {
            await Navigation.PushModalAsync(new DetailPage(cFood.ImagePath, cFood.Name, cFood.Raw, cFood.Description, cFood.Username));
        }
    }

    // เมธอดสำหรับจัดการการคลิกปุ่มในหมวดติ่มซำ
    private async void dimsumButton_Clicked(object sender, EventArgs e)
    {
        if (sender is ImageButton button && button.BindingContext is DimsumModel dimsum)
        {
            await Navigation.PushModalAsync(new DetailPage(dimsum.ImagePath, dimsum.Name, dimsum.Raw, dimsum.Description, dimsum.Username));
        }
    }

    // เมธอดสำหรับจัดการการคลิกปุ่มในหมวดเครื่องดื่ม
    private async void drinkButton_Clicked(object sender, EventArgs e)
    {
        if (sender is ImageButton button && button.BindingContext is DrinkModel drink)
        {
            await Navigation.PushModalAsync(new DetailPage(drink.ImagePath, drink.Name, drink.Raw, drink.Description, drink.Username));
        }
    }
}